{
  plugins.startup = {
    enable = true;

    settings = {
      colors = {
        background = "#ffffff";
        folded_section = "#ffffff";
      };

      header = {
        type = "text";
        oldfilesDirectory = false;
        align = "center";
        foldSection = false;
        title = "Header";
        margin = 5;
        content = [
          "   █████████    █████████   █████       █████   █████    █████ █████ █████ █████ ███████████"
          "  ███░░░░░███  ███░░░░░███ ░░███       ░░███   ░░███    ░░███ ░░███ ░░███ ░░███ ░█░░░░░░███ "
          " ░███    ░░░  ░███    ░███  ░███        ░███    ░███     ░░███ ███   ░░███ ███  ░     ███░  "
          " ░░█████████  ░███████████  ░███        ░███████████      ░░█████     ░░█████        ███    "
          "  ░░░░░░░░███ ░███░░░░░███  ░███        ░███░░░░░███       ███░███     ░░███        ███     "
          "  ███    ░███ ░███    ░███  ░███      █ ░███    ░███      ███ ░░███     ░███      ████     █"
          " ░░█████████  █████   █████ ███████████ █████   █████ ██ █████ █████    █████    ███████████"
          "  ░░░░░░░░░  ░░░░░   ░░░░░ ░░░░░░░░░░░ ░░░░░   ░░░░░ ░░ ░░░░░ ░░░░░    ░░░░░    ░░░░░░░░░░░ "
        ];
        highlight = "Statement";
        defaultColor = "";
        oldfilesAmount = 0;
      };

      body = {
        type = "mapping";
        oldfilesDirectory = false;
        align = "center";
        foldSection = false;
        title = "Menu";
        margin = 5;
        content = [
          [
            " Find File"
            "lua MiniPick.builtin.files()"
            "ff"
          ]
          [
            "󰍉 Find Word"
            "lua MiniPick.builtin.grep_live()"
            "fr"
          ]
          [
            " Recent Files"
            "lua MiniExtra and MiniExtra.pickers.oldfiles() or MiniPick.builtin.files()"
            "fg"
          ]
          [
            " File Browser"
            "Neotree"
            "fe"
          ]
          [
            " Claude Code"
            "ClaudeCode"
            "cc"
          ]
          [
            "󰧑 SecondBrain"
            "edit ~/projects/personal/SecondBrain"
            "sb"
          ]
        ];
        highlight = "string";
        defaultColor = "";
        oldfilesAmount = 0;
      };

      options = {
        paddings = [
          1
          3
        ];
      };

      parts = [
        "header"
        "body"
      ];
    };
  };
}
